DataProcessors/СервисныеОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>СервисныеОбработки</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЭквайрингу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЭквайрингу</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомиссияБанка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
						<v8:Type>cfg:CatalogRef.КредитныеДоговоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЧекККМ</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийОплатаБанковскойКартой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СчетНаОплату.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СчетНаОплату</Name>
			<Comment>Счет на оплату</Comment>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровИУслуг</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УДАЛИТЬ_ОплатаПоСчетам</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентРучнойСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Потолок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыОснования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/СервисныеОбработки/Forms/РаспределениеВходящихПлатежей/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//#15311
	СписокВидовДокументовПоКоторымВедутсяРасчеты = ОбщийМодуль.ПолучитьМассивТиповДокументовПоКоторымВедутсяРасчетыПоЗаказам();
	Если СписокВидовДокументовПоКоторымВедутсяРасчеты.Количество() = 0 Тогда
		Сообщить("Не включен учет расчетов по заказам");	
	КонецЕсли;
	Элементы.ТипДокумента.СписокВыбора.ЗагрузитьЗначения(СписокВидовДокументовПоКоторымВедутсяРасчеты);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВыполнитьРаспределение(Команда)
	
	Если ТипДокумента = Неопределено Тогда
		ПоказатьПредупреждение(, "Не указан тип заказа");
		Возврат;	
	КонецЕсли;
	
	ВыполнитьРаспределениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьРаспределениеНаСервере()
	
	//Если НЕ Константы.ВестиРасчетыПоЗаказамПоЗаказуПокупателя.Получить() Тогда
	//	Сообщить("Не включен учет расчетов по заказам покупателей");
	//	Возврат;	
	//КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ОтборПоПериоду", ЗначениеЗаполнено(Период.ДатаНачала) ИЛИ ЗначениеЗаполнено(Период.ДатаОкончания));
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ОтборПоОрганизации", ЗначениеЗаполнено(Организация));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ОтборПоКонтрагенту", ЗначениеЗаполнено(Контрагент));

	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(&ПриведениеТипа).Организация КАК Организация,
	|	ИсточникДанных.Заказ КАК Заказ,
	|	ИсточникДанных.Контрагент КАК Контрагент,
	|	ВЫРАЗИТЬ(&ПриведениеТипа).ДоговорКонтрагента КАК Договор,
	|	ИсточникДанных.СуммаОстаток КАК СуммаОстаток,
	|	ИсточникДанных.СуммаОстаток КАК КРаспределению
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Остатки КАК ИсточникДанных
	|ГДЕ
	|	(&УсловиеПоТипу)
	|	И ВЫБОР
	|			КОГДА &ОтборПоПериоду
	|				ТОГДА ИсточникДанных.Заказ.Дата Между &ДатаНачала И &ДатаОкончания
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ

	|	И ВЫБОР
	|			КОГДА &ОтборПоОрганизации
	|				ТОГДА ВЫРАЗИТЬ(&ПриведениеТипа).Организация = &Организация
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагенту
	|				ТОГДА ИсточникДанных.Контрагент = &Контрагент
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫРАЗИТЬ(&ПриведениеТипа).Дата
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсточникДанных.Период КАК Период,
	|	ИсточникДанных.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент
	|		КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|			ТОГДА ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).Контрагент
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ТОГДА ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Договор
	|		КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|			ТОГДА ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).Договор
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Договор,
	|	ИсточникДанных.Регистратор КАК ДокументОплаты,
	|	ИсточникДанных.СуммаПриход КАК СуммаДокументаОплаты
	|ПОМЕСТИТЬ ВТ_ДокументыОплаты
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(, , Регистратор, ) КАК ИсточникДанных
	|ГДЕ
	|	(ИсточникДанных.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет)
	|	И ВЫБОР
	|		КОГДА &ОтборПоОрганизации
	|			ТОГДА ИсточникДанных.Организация = &Организация
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ОтборПоКонтрагенту
	|			ТОГДА ВЫБОР 
	|				КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|					ТОГДА ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ПриходныйКассовыйОрдер).Контрагент = &Контрагент
	|			 	КОГДА ИсточникДанных.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|					ТОГДА ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ПоступлениеНаРасчетныйСчет).Контрагент = &Контрагент
	|				ИНАЧЕ
	|					ЛОЖЬ
	|			КОНЕЦ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсточникДанных.Период,
	|	ИсточникДанных.Организация,
	|	ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ОплатаБанковскойКартой).Контрагент,
	|	ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ОплатаБанковскойКартой).Договор,
	|	ИсточникДанных.Регистратор,
	//|	ИсточникДанных.СуммаПриход + ИсточникДанных.КомиссияБанкаПриход
	|	ИсточникДанных.СуммаПриход
	|ИЗ
	|	РегистрНакопления.РасчетыПоЭквайрингу.Обороты(, , Регистратор, ) КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Регистратор ССЫЛКА Документ.ОплатаБанковскойКартой
	|	И ВЫБОР
	|		КОГДА &ОтборПоОрганизации
	|			ТОГДА ИсточникДанных.Организация = &Организация
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ОтборПоКонтрагенту
	|			ТОГДА ВЫРАЗИТЬ(ИсточникДанных.Регистратор КАК Документ.ОплатаБанковскойКартой).Контрагент = &Контрагент
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсточникДанных.Дата,
	|	ИсточникДанных.Организация,
	|	ИсточникДанных.Контрагент,
	|	ИсточникДанных.ДоговорКонтрагента,
	|	ИсточникДанных.Ссылка,
	|	ИсточникДанных.СуммаАванса
	|ИЗ
	|	Документ.ВозвратТовараОтПокупателя КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Проведен
	|	И ИсточникДанных.СуммаАванса > 0
	|	И ВЫБОР
	|		КОГДА &ОтборПоОрганизации
	|			ТОГДА ИсточникДанных.Организация = &Организация
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ОтборПоКонтрагенту
	|			ТОГДА ИсточникДанных.Контрагент = &Контрагент
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИсточникДанных.Дата,
	|	ИсточникДанных.Организация,
	|	ИсточникДанных.Контрагент,
	|	ИсточникДанных.ДоговорКонтрагента,
	|	ИсточникДанных.Ссылка,
	|	ИсточникДанных.СуммаАванса
	|ИЗ
	|	Документ.ВозвратПродукции КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Проведен
	|	И ИсточникДанных.ТекущийСтатусВозврата = ЗНАЧЕНИЕ(Справочник.СтатусыВозвратаПродукции.Проверено)
	|	И ИсточникДанных.СуммаАванса > 0
	|	И ВЫБОР
	|		КОГДА &ОтборПоОрганизации
	|			ТОГДА ИсточникДанных.Организация = &Организация
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|	И ВЫБОР
	|		КОГДА &ОтборПоКонтрагенту
	|			ТОГДА ИсточникДанных.Контрагент = &Контрагент
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсточникДанных.Регистратор КАК ДокументОплаты,
	|	СУММА(ИсточникДанных.СуммаРасход) КАК СуммаРаспределения
	|ПОМЕСТИТЬ ВТ_Распределение
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Обороты(, , 
	|				Авто, 
	|				ВЫБОР
	|					КОГДА &ОтборПоОрганизации
	|						ТОГДА Заказ.Организация = &Организация
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ
	|				И
	|
	|				ВЫБОР
	|					КОГДА &ОтборПоКонтрагенту
	|						ТОГДА Контрагент = &Контрагент
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ИсточникДанных
	|ГДЕ
	|	(ИсточникДанных.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ОплатаБанковскойКартой
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ВозвратТовараОтПокупателя
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ВозвратПродукции)
	|	И (&УсловиеПоТипу)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсточникДанных.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ИсточникДанных.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыОплаты.Период КАК Период,
	|	ВТ_ДокументыОплаты.Организация КАК Организация,
	|	ВТ_ДокументыОплаты.Контрагент КАК Контрагент,
	|	ВТ_ДокументыОплаты.Договор КАК Договор,
	|	ВТ_ДокументыОплаты.ДокументОплаты КАК ДокументОплаты,
	|	ВТ_ДокументыОплаты.СуммаДокументаОплаты КАК СуммаДокументаОплаты,
	|	ЕСТЬNULL(ВТ_Распределение.СуммаРаспределения, 0) КАК СуммаРаспределения,
	|	ВТ_ДокументыОплаты.СуммаДокументаОплаты - ЕСТЬNULL(ВТ_Распределение.СуммаРаспределения, 0) КАК ДоступноКРаспределению
	|ИЗ
	|	ВТ_ДокументыОплаты КАК ВТ_ДокументыОплаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Распределение КАК ВТ_Распределение
	|		ПО (ВТ_Распределение.ДокументОплаты = ВТ_ДокументыОплаты.ДокументОплаты)
	|ГДЕ
	|	НЕ ВТ_ДокументыОплаты.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|	И ВТ_ДокументыОплаты.СуммаДокументаОплаты - ЕСТЬNULL(ВТ_Распределение.СуммаРаспределения, 0) > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ДокументыОплаты.Период";
	
	//МассивТипов.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	УсловиеПоТипу = "";
	Если ТипДокумента = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		УсловиеПоТипу  = "ИсточникДанных.Заказ ССЫЛКА Документ.ЗаказПокупателя";
		ПриведениеТипа = "ИсточникДанных.Заказ КАК Документ.ЗаказПокупателя";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.РеализацияТоваровИУслуг") Тогда
		УсловиеПоТипу  = "ИсточникДанных.Заказ ССЫЛКА Документ.РеализацияТоваровИУслуг";
		ПриведениеТипа = "ИсточникДанных.Заказ КАК Документ.РеализацияТоваровИУслуг";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказДоговор") Тогда
		УсловиеПоТипу  = "ИсточникДанных.Заказ ССЫЛКА Документ.ЗаказДоговор";
		ПриведениеТипа = "ИсточникДанных.Заказ КАК Документ.ЗаказДоговор";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.Монтаж") Тогда
		УсловиеПоТипу  = "ИсточникДанных.Заказ ССЫЛКА Документ.Монтаж";
		ПриведениеТипа = "ИсточникДанных.Заказ КАК Документ.Монтаж";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СчетНаОплату") Тогда
		УсловиеПоТипу  = "ИсточникДанных.Заказ ССЫЛКА Документ.СчетНаОплату";
		ПриведениеТипа = "ИсточникДанных.Заказ КАК Документ.СчетНаОплату";
	КонецЕсли;
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоТипу", УсловиеПоТипу);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПриведениеТипа", ПриведениеТипа);
	
	Запрос.Текст = ТекстЗапроса;
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаЗаказов = РезультатЗапроса[0].Выгрузить();
	ТаблицаДокументов = РезультатЗапроса[3].Выгрузить();
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОплатаБанковскойКартой"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВозвратТовараОтПокупателя"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ВозвратПродукции"));
	
	МассивТиповЗаказа = Новый Массив;
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.ЗаказПокупателя"));
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.ЗаказДоговор"));
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.Монтаж"));
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.РеализацияТоваровИУслуг"));
	МассивТиповЗаказа.Добавить(Тип("ДокументСсылка.СчетнаОплату"));

	ТаблицаРаспределения = Новый ТаблицаЗначений;
	ТаблицаРаспределения.Колонки.Добавить("ДокументОплаты", Новый ОписаниеТипов(МассивТипов));
	ТаблицаРаспределения.Колонки.Добавить("Заказ", Новый ОписаниеТипов(МассивТиповЗаказа));
	ТаблицаРаспределения.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15, 2)));
	
	Для каждого СтрокаДокументаОплаты из ТаблицаДокументов Цикл
		ДоступноКРаспределению = СтрокаДокументаОплаты.ДоступноКРаспределению;
		Для каждого СтрокаЗаказа из ТаблицаЗаказов Цикл
			
			Если СтрокаЗаказа.КРаспределению <= 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаЗаказа.Организация = СтрокаДокументаОплаты.Организация
				И СтрокаЗаказа.Контрагент = СтрокаДокументаОплаты.Контрагент
				И СтрокаЗаказа.Договор = СтрокаДокументаОплаты.Договор Тогда
				// документ оплаты подходит под заказ
				
				СуммаРаспределенияНаЗаказ = Мин(ДоступноКРаспределению, СтрокаЗаказа.КРаспределению);
				
			    Если СуммаРаспределенияНаЗаказ > 0 Тогда
					НоваяСтрока = ТаблицаРаспределения.Добавить();
					НоваяСтрока.ДокументОплаты = СтрокаДокументаОплаты.ДокументОплаты;
			    	НоваяСтрока.Заказ = СтрокаЗаказа.Заказ;
					НоваяСтрока.Сумма = СуммаРаспределенияНаЗаказ;
					
					// уменьшаем суммы
					ДоступноКРаспределению = ДоступноКРаспределению - СуммаРаспределенияНаЗаказ;
					СтрокаЗаказа.КРаспределению = СтрокаЗаказа.КРаспределению - СуммаРаспределенияНаЗаказ;
				КонецЕсли;
				
				// если по документу оплаты ничего не осталось, то двигаемся дальше
				Если ДоступноКРаспределению = 0 Тогда
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;		
	КонецЦикла;
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРаспределения", ТаблицаРаспределения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаРаспределения.ДокументОплаты КАК ДокументОплаты,
	|	ТаблицаРаспределения.Заказ КАК Заказ,
	|	ТаблицаРаспределения.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТаблицаРаспределения КАК ТаблицаРаспределения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.ДокументОплаты КАК ДокументОплаты,
	|	ВТ.Заказ КАК Заказ,
	|	ВТ.Сумма КАК Сумма
	|ИЗ
	|	ВТ КАК ВТ
	|ИТОГИ ПО
	|	ДокументОплаты";
	
	ДеревоЗначений = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	ЗначениеВРеквизитФормы(ДеревоЗначений, "ДеревоРаспределения");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ИсправитьОтрицательныеРаспределения(Команда)
	ИсправитьОтрицательныеРаспределенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсправитьОтрицательныеРаспределенияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсточникДанных.Период КАК Период,
	|	ИсточникДанных.Регистратор КАК ДокументОплаты,
	|	ИсточникДанных.Заказ КАК Документ,
	|	ВЫРАЗИТЬ(ИсточникДанных.Заказ КАК Документ.ЗаказПокупателя).СуммаДокумента КАК СуммаДокумента,
	|	ИсточникДанных.СуммаРасход КАК СуммаРаспределения,
	|	ВЫРАЗИТЬ(ИсточникДанных.Заказ КАК Документ.ЗаказПокупателя).СуммаДокумента - ИсточникДанных.СуммаРасход КАК ОстатокРаспределения
	|ИЗ
	|	РегистрНакопления.РасчетыПоЗаказам.Обороты(, , Регистратор, ) КАК ИсточникДанных
	|ГДЕ
	|	ИсточникДанных.Заказ ССЫЛКА Документ.ЗаказПокупателя
	|	И (ИсточникДанных.Регистратор ССЫЛКА Документ.ПриходныйКассовыйОрдер
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ОплатаБанковскойКартой
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ПоступлениеНаРасчетныйСчет
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ВозвратТовараОтПокупателя
	|			ИЛИ ИсточникДанных.Регистратор ССЫЛКА Документ.ВозвратПродукции)
	|	И ВЫРАЗИТЬ(ИсточникДанных.Заказ КАК Документ.ЗаказПокупателя).СуммаДокумента < ИсточникДанных.СуммаРасход";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокОбъект = Выборка.ДокументОплаты.ПолучитьОбъект();
		
		Для каждого СтрокаТЧ из ДокОбъект.РаспределениеПлатежа Цикл
			Если СтрокаТЧ.Документ = Выборка.Документ и СтрокаТЧ.Сумма = Выборка.СуммаРаспределения Тогда
				  СтрокаТЧ.Сумма = Выборка.СуммаДокумента;
			КонецЕсли;
		КонецЦикла;
		
		ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(описаниеОшибки());
			КонецПопытки;
	КонецЦикла;
	

КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьДокументы(Команда)
	ЗаполнитьДокументыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументыНаСервере()
	
	СтрокиДокументов = ДеревоРаспределения.ПолучитьЭлементы();
	
	Для каждого СтрокаДокумента из СтрокиДокументов Цикл
		
		ИмяТЧ = "РаспределениеПлатежа";
		Если ТипЗнч(СтрокаДокумента.ДокументОплаты) = Тип("ДокументСсылка.ВозвратТовараОтПокупателя") 
			ИЛИ ТипЗнч(СтрокаДокумента.ДокументОплаты) = Тип("ДокументСсылка.ВозвратПродукции")	
			Тогда
			ИмяТЧ = "ЗачетАванса";
		КонецЕсли;
		
		ДокОбъект = СтрокаДокумента.ДокументОплаты.ПолучитьОбъект();
				
		СтрокиЗаказов = СтрокаДокумента.ПолучитьЭлементы();	
		Для каждого СтрокаЗаказа из СтрокиЗаказов Цикл	
			СтрокаТЧ = ДокОбъект[ИмяТЧ].Добавить();
			
			СтрокаТЧ.Документ = СтрокаЗаказа.Заказ;
			СтрокаТЧ.Сумма = СтрокаЗаказа.Сумма;
		КонецЦикла;		
		
		Если ИмяТЧ = "РаспределениеПлатежа" Тогда
			ОбработкаТабличныхЧастейСервер.ЗаполнитьОснованияПоРаспределению(ДокОбъект.Основания, ДокОбъект.РаспределениеПлатежа);
		КонецЕсли;
		
		ДокОбъект.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Сообщить(описаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры
